// © Copyright 2004-2013, 2015-2016 HP Development Company, L.P.

UtilityWindowPreferredSize = "{796, 406}";

kCheckChangesAlertTitleKey = "You have changed data. Do you want to continue?";
kCheckChangesAlertContinueButtonTitleKey = "Continue";
kCheckChangesAlertMessageKey = "If you continue, you will lose your changes. Click Cancel to discard your action and continue work with task.";

DeviceStatusUnknown = "Unknown";

NoItemsMenuTitle = "No items available";

NotEnoughSpaceTitle = "Could not launch HP Utility";
NotEnoughSpaceMsg = "Your startup disk is almost full. You need to make more space available on your startup disk by deleting files.";

RecentUnreachableTitle = "Could not connect";
RecentUnreachableMsg = "%@ is currently unavailable. Please check if it is turned on and connected, or try again later.";

AirPortDeviceErrorTitle = "HP Utility cannot work with devices connected to AirPort.";
SharedDeviceErrorTitle = "HP Utility cannot work with shared devices.";
NotDirectDeviceErrorDescription = "Please connect device directly to your Mac to work with it.";

NoUtilityMessage = "Please reinstall the software that came with your device.";

// menu items
ShowAdvanced = "Show Advanced Options";
HideAdvanced = "Hide Advanced Options";

DeviceOKButtonTitle = "OK";
DeviceResumeButtonTitle = "Resume";
SupplyInfoTaskTitle = "Supply Info";
TravelInfoTaskTitle = "Travel Info";

kTaskGroupUnknownTitleKey = "Other";
kTaskGroupInformationAndSupportTitleKey = "Information and Support";
kTaskGroupInformationAndPrintQualityTitleKey = "Information and Print Quality";
kTaskGroupPrinterSettingsTitleKey = "Printer Settings";
kTaskGroupFaxSettingsTitleKey = "Fax Settings";
kTaskGroupNetworkSettingsTitleKey = "Network Settings";
kTaskGroupInformationTitleKey = "Information";
kTaskGroupColorCenterTitleKey = "HP Color Center";
kTaskGroupConfigurationTitleKey = "Configuration";
kTaskGroupSupportTitleKey = "Support";
kTaskGroupJobCenterTitleKey = "Job Center";
kHSDTaskGroupScanSettingsTitleKey = "Scan Settings";

ApplyButtonTitle = "Apply Now";

kViewMenuTitle = "View";

AskSaveChangesAlertTitle = "You have changed settings on this screen";
AskSaveChangesAlertMsg = "Do you want to apply changes before closing it?";
AskSaveChangesDontApplyButtonTitle = "Don't Apply";
AskSaveCahngesApplyButtonTitle = "Apply";

MultipleAskSaveChangesAlertTitle = "You have changed settings in %i windows";
MultipleAskSaveChangesAlertMsg = "Do you want to review these changes before quitting?";
MultipleAskSaveChangesDiscardButtonTitle = "Discard Changes";
MultipleAskSaveChangesReviewButtonTitle = "Review Changes...";

ConnectingMessage = "Connecting to device\n%@";

DefaultWindowTitleString = "HP Utility";
DeviceNotSelectedMessageString = "Please select a device to get started";

DevicesItemTitleString = "Devices";
DevicesItemTooltipString = "Show/Hide Devices";
SupportItemTitleString = "HP Support";
SupportItemTooltipString = "HP Online Support";
SuppliesItemTitleString = "Supplies";
SuppliesItemTooltipString = "Shop for Supplies Online";
RegistrationItemTitleString = "Registration";
RegistrationItemTooltipString = "Online Registration";
RecyclingItemTitleString = "Recycling";
RecyclingItemTooltipString = "Return & Recycling Online";
MarsItemTitleString = "Product Improvement";
MarsItemTooltipString = "HP Product Improvement Study";
TasksItemTitleString = "All Settings";
TasksItemTooltipString = "Show All Settings";
SearchItemTitleString = "Search";
SearchItemTooltipString = "Search plug-in or keyword";

HSDAddDevicesToolTip = "Add devices";
HSDRemoveDevicesToolTip = "Remove the selected device or smart group";
HSDPullDownMenuToolTip = "Actions menu";
TaskCellWidth = "98";

PrintersGroupString = "DEVICES";
SmartGroupsString = "SMART GROUPS";

PrinterName = "Device name";
ModelName = "Model";
SerialNumber = "S/N";
IPAddress = "IP Address";
BluetoothAddress = "Address";
ConnectionType = "Connection";

kSmartGroupDefaultName = "Smart Group";
kSmartGroupRulePropertyModel = "Model";
kSmartGroupRulePropertyName = "Name";
kSmartGroupRulePropertyURI = "URI";
kSmartGroupRulePropertyIPAddress = "IP Address";
kSmartGroupRulePropertyConnectionType = "Connection type";

kSmartGroupRuleCriterionContains = "Contains";
kSmartGroupRuleCriterionDoesntContain = "Does not contain";
kSmartGroupRuleCriterionIs = "Is";
kSmartGroupRuleCriterionIsNot = "Is not";
kSmartGroupRuleCriterionStartsWith = "Starts with";
kSmartGroupRuleCriterionEndsWith = "Ends with";

kSmartGroupRuleValueTypeUSB = "USB";
kSmartGroupRuleValueTypeIP = "IP";
kSmartGroupRuleValueTypeBonjour = "Bonjour";
kSmartGroupRuleValueTypeBluetooth = "Bluetooth";

HSDRulesMatchStyleAll = "all";
HSDRulesMatchStyleAny = "any";

IncompatibleTasksTitle = "Incompatible components";
IncompatibleTasksMessage = "Some components installed on your computer were developed for another version of HP Utility. These components will not be loaded and some functionality related to your device will not be accessible. Please click HP Support item on the toolbar to visit HP Online Support site and download the latest versions of HP software.";

NoComponentsTitle = "Some HP Utility components were not found";

ShowDevicesItemTitle = "Show Devices";
HideDevicesItemTitle = "Hide Devices";
ShowToolbarItemTitle = "Show Toolbar";
HideToolbarItemTitle = "Hide Toolbar";


DevicesMenuSetupDeviceItemTitle = "Setup New Device…";
DevicesMenuSetupSelectedDeviceItemTitle = "Setup Selected Device…";
DevicesMenuSetupWirelessItemTitle = "HP Auto Wireless Connect…";
DevicesMenuAddDevicesItemTitle = "Add Devices...";
DevicesMenuAddDeviceManuallyItemTitle = "Add Device Manually...";
DevicesMenuNewSmartGroupItemTitle = "New Smart Group...";
DevicesMenuEditSmartGroupItemTitle = "Edit Smart Group...";
DevicesMenuPrintersMenuTitle = "Devices List";
DevicesMenuEmptyItemTitle = "(Empty)";

DevicesMenuRemoveDeviceItemTitle = "Remove Selected Device";
DevicesMenuRemoveSmartGroupItemTitle = "Delete Smart Group";
DevicesMenuSortByItemTitle = "Sort By";
DevicesMenuNameItemTitle = "Name";
DevicesMenuAvailabilityItemTitle = "Availability";

HSDAddDeviceManuallyItemTitle = "Add Device Manually...";
HSDNewSmartGroupItemTitle = "New Smart Group...";
HSDEditSmartGroupItemTitle = "Edit Smart Group...";

DeviceNotAvailableMessageString = "Selected device is not currently available. Please select another device.";
ScanjetDeviceNotAvailableMessageString = "Selected device is not currently available. Please make sure that device is powered on, connected to the computer and all required software is installed.";

AppManagerItemTitleString = "Applications";
AppManagerItemTooltipString = "Applications";

AppManagerAskApplyChangesAlertTitle = "Do you want to apply the changes you made?";
AppManagerAskApplyChangesAlertMsg = "Your changes will be lost if you don't apply them.";
AppManagerApplyButtonTitle = "Apply";
CancelButtonTitleKey = "Cancel";
AppManagerDontApplyButtonTitle = "Don't Apply";
NoSaveTitle = "Could not save file";
DidNotSaveMessage = "Please check that there is enough disk space, and you have access privileges to save the file in the specified location.";

ConnectMenuItemTitleFormat = "Connect to %@";
EditMenuItemTitleFormat = "Edit %@...";
RemoveMenuItemTitleFormat = "Remove %@";

ShowOnlineAccessWarningsCommandTitle = "Show Online Access Warnings";
HideOnlineAccessWarningsCommandTitle = "Hide Online Access Warnings";

HSDSmartGroupNameTitle = "Smart Group Name:";
HSDMatchTextFieldTitle1 = "Match";
HSDMatchTextFieldTitle2 = "of the following rules:";
HSDCancelButtonTitle = "Cancel";
HSDOKButtonTitle = "OK";

// locked feature view
HSDDisabledFeatureTitle = "This feature was locked or disabled by the device administrator";
HSDDisabledFeatureDescription = "It can be enabled via Device Administration panel. Click \"Go\" button below to go to that panel.";
HSDNoWayToUnlockDescription = "You cannot use this function because it has been locked or disabled. For more information, contact the person who set up the printer.";
HSDGoButton = "Go";

// Alert for Ink Subscription
SubscribedSuppliesTitle = "Your device has active ink subscription";
SubscribedSuppliesMessage = "Don’t forget… You can obtain all your replacement cartridges for this printer at a discount through HP Instant Ink! You can still visit HP's online store to shop for accessories or supplies for other devices.";
GoToStoreButtonTitle = "Go to store";

//Search Window
SearchWindowTitle = "Search";
SearchWindowTaskTitle = "Search:";
SearchWindowButtonCancelTitle = "Cancel";
SearchWindowButtonSearchTitle = "Search";

//Main Menu
"HP Utility" = "HP Utility";
"About HP Utility" = "About HP Utility";
"Hide HP Utility" = "Hide HP Utility";
"Hide Others" = "Hide Others";
"Show All" = "Show All";
"Quit HP Utility" = "Quit HP Utility";

"Devices" = "Devices";

"Edit" = "Edit";
"Undo" = "Undo";
"Redo" = "Redo";
"Cut" = "Cut";
"Copy" = "Copy";
"Paste" = "Paste";
"Delete" = "Delete";
"Select All" = "Select All";

"View" = "View";

"Window" = "Window";
"Close" = "Close";
"Minimize" = "Minimize";
"Zoom" = "Zoom";
"Bring All to Front" = "Bring All to Front";

Version = "Version";

// Global Mode
MarsUnavailableAlertTitle = "Cannot configure HP Product Improvement Study";
MarsUnavailableAlertDescription = "Your devices are not eligible for the HP Product Improvement Study research program.";
MarsUnavailableForOnlineDevicesAlertDescription = "Your online devices are not eligible for the HP Product Improvement Study research program. Turn on your other devices, connect them to your Mac or network, and then try again.";
